philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/src/stm32w108xx_sc.c
/**
  ******************************************************************************
  * @file    stm32w108xx_sc.c
  * @author  MCD Application Team
  * @version V1.0.1
  * @date    30-November-2012
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of the Serial Controller (SC):
  *           + Universal Asynchronous Receiver/Transmitter communication
  *           + Serial Peripheral Interface communication
  *           + Inter-Integrated Circuit communication
  *           + DMA transfers management in UART and SPI modes
  *
  *  @verbatim
  *
 ===============================================================================
                       ##### How to use this driver #####
 ===============================================================================
  (#) Peripherals GPIO Configuration: 
       (++) Select the desired pin GPIO_InitStruct->GPIO_Pin according to the
            defined Initialization and Configuration Tables for each serial control
            modes (UART, SPI master, SPI Salve and I2C).
       (++) Refer to the Initialization and Configuration Tables to configure 
            the GPIO_InitStruct->GPIO_Mode
       (++) Call GPIO_Init() function.
   (#) For the I2C mode Program the clock rate using the I2C_Init() function.
   (#) For the SPI mode Program the Polarity, Phase, First Data, Clcok rate
       and the Peripheral Mode rate using the SPI_Init() function.
   (#) For the UART mode Program the Baud Rate, Word Length , Stop Bit, Parity and Hardware 
       flow control using the UART_Init() function.
   (#) Enable the PPP using the PPP_Cmd() function. 
   (#) For UART Mode set pull-up resistors on Tx and Rx pins using GPIO_SetBits() function.
   (#) Enable the NVIC and the corresponding interrupt using the function. 
       PPP_ITConfig() if you need to use interrupt mode. 
   (#) When using the DMA mode 
       (++) Configure the DMA using SC_DMA_Init() function.
       (++) Active the needed channel Request using SC_DMA_ChannelLoadEnable() function.

   [..]
   (@) PPP can be UART, SPI or I2C.
   (@) The DMA is not support for I2C mode.

    @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */


/* Includes ------------------------------------------------------------------*/
#include "stm32w108xx_sc.h"

/** @addtogroup STM32W108xx_StdPeriph_Driver
  * @{
  */

/** @defgroup SERIAL_CONTROLLER
  * @brief SC driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* I2C ADD0 mask */
#define OAR1_ADD0_Set           ((uint8_t)0x01)
#define OAR1_ADD0_Reset         ((uint8_t)0xFE)
#define SPICR_CLEAR_MASK        ((uint32_t)0xFFFFFFE8)

/* Private macro -------------------------------------------------------------*/
#define    ABS(x)         ((x) > 0) ? (x) : (-(x))
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup SC_Private_Functions
  * @{
  */

/** @defgroup SC_Group1 Universal Asynchronous Receiver/Transmitter communication
 *  @brief   universal asynchronous receiver transmitter functions 
 *
@verbatim   
 ===============================================================================
           ##### Universal Asynchronous Receiver-Transmitter functions #####
 ===============================================================================
    [..] This section provides a set of functions allowing to handles the Universal
         Asynchronous Receiver Transmitter communication.
    
    (@) Only SC1 include an universal asynchronous receiver transmitter (UART) controller.

*** Initialization and Configuration ***
 =======================================
    [..] The GPIO pins that can be assigned to UART interface are listed in the following table:
   +------------------------------------------------------+     
   |Parameter | Direction | GPIO configuration |  SC1 pin | 
   |----------|-----------|--------------------|----------|             
   |   TXD    |    Out    |  Alternate Output  |   PB1    |
   |          |           |    (push-pull)     |          |
   |----------|-----------|-------------------------------|  
   |   RXD    |    In     |        Input       |   PB2    |
   |----------|-----------|--------------------|----------|             
   |   nCTS   |    In     |        Input       |   PB3    |
   |----------|-----------|-------------------------------|  
   |   nRTS   |    Out    |  Alternate Output  |   PB4    |
   |          |           |    (push-pull)     |          |
   +------------------------------------------------------+

    [..] For the asynchronous mode these parameters can be configured: 
         (+) Baud Rate.
         (+) Word Length.
         (+) Stop Bit.
         (+) Parity: If the parity is enabled, then the MSB bit of the data written
              in the data register is transmitted but is changed by the parity bit.
              Depending on the frame length defined by the M bit (7-bits or 8-bits),
              the possible UART frame formats are as listed in the following table:

