philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/src/stm32w108xx_sc.c
   +-------------------------------------------------------------+     
   |   M bit |  PCE bit  |            UART frame                 |
   |---------------------|---------------------------------------|             
   |    0    |    0      |    | SB | 7 bit data | STB |          |
   |---------|-----------|---------------------------------------|  
   |    0    |    1      |    | SB | 7 bit data | PB | STB |     |
   |---------|-----------|---------------------------------------|  
   |    1    |    0      |    | SB | 8 bit data | STB |          |
   |---------|-----------|---------------------------------------|  
   |    1    |    1      |    | SB | 8 bit data | PB | STB |     |
   +-------------------------------------------------------------+            

         (+) Hardware flow control.
    [..] The UART_Init() function follows the UART asynchronous configuration 
         procedure (details for the procedure is available in datasheet.

*** Data transfers ***
 =====================
    [..] In reception, data are received and then stored into an internal Rx buffer while 
         In transmission, data are first stored into an internal Tx buffer before being 
         transmitted.

    [..] The read access of the SCx_DR register can be done using 
         UART_ReceiveData() function and returns the Rx buffered value. Whereas a write 
         access to the SCx_DR can be done using UART_SendData() function and stores 
         the written data into Tx buffer.

 *** Interrupts and flags management ***
 =======================================
    [..] This subsection provides also a set of functions allowing to configure the 
         UART Interrupts sources, Requests and check or clear the flags or pending bits status. 
         The user should identify which mode will be used in his application to 
         manage the communication: Polling mode, Interrupt mode or DMA mode(refer SC_Group4).

    [..] In Polling Mode, the UART communication can be managed by these flags:
         (#) UART_FLAG_TXE: to indicate the status of the transmit buffer register.
         (#) UART_FLAG_RXNE: to indicate the status of the receive buffer register.
         (#) UART_FLAG_IDLE: to indicate the status of the Idle Line.
         (#) UART_FLAG_CTS: to indicate the status of the nCTS line.
         (#) UART_FLAG_FE: to indicate if a frame error occur.
         (#) UART_FLAG_PE: to indicate if a parity error occur.
         (#) UART_FLAG_OVR: to indicate if an Overrun error occur.
    [..] In this mode it is advised to use the following functions:
         (+) FlagStatus UART_GetFlagStatus(SC_UART_TypeDef* SCx_UART, uint32_t UART_FLAG).
    [..] In this mode all the UART flags are cleared by hardware.

    [..] In Interrupt Mode, the UART communication can be managed by 7 interrupt 
         sources and 7 pending bits:
         (+) Pending Bits:
             (##) UART_IT_PE: to indicate the status of Parity Error interrupt.  
             (##) UART_IT_FE: to indicate the status of Framing Error interrupt.
             (##) UART_IT_UND: to indicate the status of UnderRun Error interrupt.
             (##) UART_IT_OVR: to indicate the status of OverRun Error interrupt.
             (##) UART_IT_IDLE: to indicate the status of IDLE line detected interrupt.
             (##) UART_IT_TXE: to indicate the status of the Transmit data register empty interrupt.
             (##) UART_IT_RXNE: to indicate the status of the Data Register not empty interrupt.

         (+) Interrupt Source:
             (##) UART_IT_PE: specifies the interrupt source forParity Error pending interrupt.  
             (##) UART_IT_FE: specifies the interrupt source for Framing Error pending interrupt.
             (##) UART_IT_UND: specifies the interrupt source for UnderRun Error pending interrupt.
             (##) UART_IT_OVR: specifies the interrupt source for OverRun Error pending interrupt.
             (##) UART_IT_IDLE: specifies the interrupt source for IDLE line detected pending interrupt.
             (##) UART_IT_TXE: specifies the interrupt source for the Transmit data register empty pending interrupt.
             (##) UART_IT_RXNE: specifies the interrupt source for the Data Register not empty pending interrupt.
             -@@- These parameters are coded in order to use them as interrupt source 
                  or as pending bits.
    [..] In this Mode it is advised to use the following functions:
         (+) void UART_ITConfig(SC_IT_TypeDef* SCx_IT, uint32_t UART_IT, FunctionalState NewState).
         (+) ITStatus UART_GetITStatus(SC_IT_TypeDef* SCx_IT, uint32_t UART_IT).
         (+) void UART_ClearITPendingBit(SC_IT_TypeDef* SCx_IT, uint32_t UART_IT).

@endverbatim
  * @{
  */

/**
  * @brief  Deinitializes the SCx_UART peripheral registers to their default reset values.
  * @param  SCx_UART: where x can be 1 to select the Serial controller peripheral.
  * @retval None
  */
void UART_DeInit(SC_UART_TypeDef* SCx_UART)
{
  /* Check the parameters */
  assert_param(IS_UART_PERIPH(SCx_UART));
  
  SCx_UART->CR = 0;
  SCx_UART->UARTCR = 0;
  SCx_UART->UARTBRR1 = 0;
  SCx_UART->UARTBRR2 = 0;
}

/**
  * @brief  Initializes the SC1_UART peripheral according to the specified
  *   parameters in the UART_InitStruct .
  * @param  SCx_UART: where x can be 1 to select the Serial controller peripheral.
  * @param  UART_InitStruct: pointer to a UART_InitTypeDef structure
  *   that contains the configuration information for the specified SC1_UART peripheral.
  * @retval None
  */
void UART_Init(SC_UART_TypeDef* SCx_UART, UART_InitTypeDef* UART_InitStruct)
{
  int32_t temp1, temp2 = 0;
  uint32_t clockfrequency = 0;
  uint32_t N = 0;

  /* Check the parameters */
  assert_param(IS_UART_PERIPH(SCx_UART));
  assert_param(IS_UART_BAUDRATE(UART_InitStruct->UART_BaudRate));
  assert_param(IS_UART_WORD_LENGTH(UART_InitStruct->UART_WordLength));   
  assert_param(IS_UART_STOPBITS(UART_InitStruct->UART_StopBits));
  assert_param(IS_UART_PARITY(UART_InitStruct->UART_Parity));
  assert_param(IS_UART_HARDWARE_FLOW_CONTROL(UART_InitStruct->UART_HardwareFlowControl));
  
  /* Disable the selected UART by clearing the MODE bits in the CR register */
  SCx_UART->CR &= (uint16_t)~((uint16_t)SC_CR_MODE);
  
