philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/src/stm32w108xx_sc.c
  /*---------------------------- UARTCR Configuration ------------------------*/
  /* Configure the USART Word Length, Parity and mode ------------------------*/
  /* Set STOP bit according to USART_StopBits value */
  /* Set the M bits according to UART_WordLength value */
  /* Set PCE and PS bits according to USART_Parity value */
  /* Set HFCE and AHFCE bits according to UART_HardwareFlowControl value */
  SCx_UART->UARTCR = (uint32_t)(UART_InitStruct->UART_WordLength | UART_InitStruct->UART_Parity |
                                UART_InitStruct->UART_StopBits | UART_InitStruct->UART_HardwareFlowControl);
  /*---------------------------- UART BRR Configuration ----------------------*/
  /* Configure the UART Baud Rate --------------------------------------------*/
  clockfrequency = CLK_GetClocksFreq();
  N = (uint16_t)(clockfrequency/(2*(UART_InitStruct->UART_BaudRate)));
  
  /* Write to UART BRR1 */
  SCx_UART->UARTBRR1 &= (uint32_t)~SC_UARTBRR1_N;
  SCx_UART->UARTBRR1 |= (uint32_t)N;

  temp1 = (int32_t)(clockfrequency/(2*N));
  temp2 = (int32_t)(clockfrequency/(2*N +1));

  temp1 = ABS((int32_t)((int32_t)temp1 - (int32_t)UART_InitStruct->UART_BaudRate));
  temp2 = ABS((int32_t)((int32_t)temp2 - (int32_t)UART_InitStruct->UART_BaudRate));
  
  /* Check the baud rate error and write to UART BRR2 */
  if(temp1 > temp2)
  {
    SCx_UART->UARTBRR2 |= (uint32_t)SC_UARTBRR1_F;
  }
  else
  {
    SCx_UART->UARTBRR2 &=(uint32_t)~SC_UARTBRR1_F;
  }
}

/**
  * @brief  Fills each UART_InitStruct member with its default value.
  * @param  UART_InitStruct: pointer to a UART_InitTypeDef structure
  *   which will be initialized.
  * @retval None
  */
void UART_StructInit(UART_InitTypeDef* UART_InitStruct)
{
  /* UART_InitStruct members default value */
  UART_InitStruct->UART_BaudRate = 115200;
  UART_InitStruct->UART_WordLength = UART_WordLength_8b;
  UART_InitStruct->UART_StopBits = UART_StopBits_1;
  UART_InitStruct->UART_Parity = UART_Parity_No;
  UART_InitStruct->UART_HardwareFlowControl = UART_HardwareFlowControl_Disable;  
}

/**
  * @brief  Enables or disables the RTS assertion for the specified SC1_UART peripheral.
  * @param  SCx_UART: where x can be 1 to select the Serial controller peripheral.
  * @param  NewState: new state of the SC1_UART peripheral.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_RTSAssertionCmd(SC_UART_TypeDef* SCx_UART, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_UART_PERIPH(SCx_UART));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* The RTS signal is asserted by setting the nRTS bit in the UARTCR register */
    SCx_UART->UARTCR |= SC_UARTCR_nRTS;
  }
  else
  {
    /* The RTS signal is deasserted by clearing the nRTS bit in the UARTCR register */
    SCx_UART->UARTCR &= (uint16_t)~((uint16_t)SC_UARTCR_nRTS);
  }
}

/**
  * @brief  Enables or disables the specified SC1_UART peripheral.
  * @param  SCx_UART: where x can be 1 to select the Serial controller peripheral.
  * @param  NewState: new state of the SC1_UART peripheral.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_Cmd(SC_UART_TypeDef* SCx_UART, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_UART_PERIPH(SCx_UART));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the selected UART by setting the MODE bit 0 in the CR register */
    SCx_UART->CR &= (uint16_t)~((uint16_t)SC_CR_MODE);
    SCx_UART->CR |= SC_CR_MODE_0;
  }
  else
  {
    /* Disable the selected UART by clearing the MODE bits in the CR register */
    SCx_UART->CR &= (uint16_t)~((uint16_t)SC_CR_MODE);
  }
}

/**
  * @brief  Enables or disables the specified SCx_UART interrupts.
  * @param  SCx_IT: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  UART_IT: specifies the SCx_UART interrupt source to be enabled or disabled. 
  *   This parameter can be one of the following values:
  *     @arg UART_IT_PE: Parity error interrupt mask
  *     @arg UART_IT_FE: Frame error interrupt mask
  *     @arg UART_IT_UND: Underrun interrupt mask (to be checked)
  *     @arg UART_IT_OVR: Overrun interrupt mask
  *     @arg UART_IT_IDLE: Idle line detected interrupt mask
  *     @arg UART_IT_TXE: Transmit data register empty interrupt mask
  *     @arg UART_IT_RXNE: Data Register not empty interrupt mask
  * @param  NewState: new state of the specified SCx_UART interrupt source.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_ITConfig(SC_IT_TypeDef* SCx_IT, uint32_t UART_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_UART_IT_PERIPH(SCx_IT));
  assert_param(IS_UART_IT(UART_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the selected UART interrupt */
    SCx_IT->IER |= UART_IT;
  }
  else
  {
    /* Disable the selected UART interrupt */
    SCx_IT->IER &= (uint16_t)~((uint16_t)UART_IT);
  }
}

/**
  * @brief  Trigger event configuration to handle the specified SCx_UART interrupt.
  * @param  SCx_IT: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  UART_IT: specifies the SCx_UART interrupt to be configured. 
  *   This parameter can be one of the following values:
  *     @arg UART_IT_IDLE: Idle line detected interrupt
  *     @arg UART_IT_TXE: Transmit data register empty interrupt
  *     @arg UART_IT_RXNE: Data Register not empty interrupt
  * @param  TriggerEvent: Trigger event configuration of the specified SCx_UART interrupt.
  *   This parameter can be one of the following values:
  *     @arg SC_TriggerEvent_Edge: The specified SCx_UART interrupt will be generated on edge
  *     @arg SC_TriggerEvent_Level: The specified SCx_UART interrupt will be generated on level
  * @retval None
  */
void UART_TriggerEventConfig(SC_IT_TypeDef* SCx_IT, uint32_t UART_IT, uint32_t TriggerEvent)
{
  /* Check the parameters */
  assert_param(IS_UART_IT_PERIPH(SCx_IT));
  assert_param(IS_UART_TRIGGEREVENT_IT(UART_IT));
  assert_param(IS_SC_TRIGGEREVENT(TriggerEvent));
  
  if (TriggerEvent != SC_TriggerEvent_Edge)
  {
    /* The UART_IT interrupt will be handled on level */
    SCx_IT->ICR |= UART_IT;
  }
  else
  {
    /* The UART_IT interrupt will be handled on edge */
    SCx_IT->ICR &= (uint16_t)~((uint16_t)UART_IT);
  }
}

/**
  * @brief  Transmits a Data through the SC1_UART peripheral.
  * @param  SCx_UART: where x can be 1 to select the Serial controller peripheral.
  * @param  Data: Data to be transmitted.
  * @retval None
  */
void UART_SendData(SC_UART_TypeDef* SCx_UART, uint8_t Data)
{
  uint32_t scxbase = 0x00;

  /* Check the parameters */
  assert_param(IS_UART_PERIPH(SCx_UART));

  scxbase = (uint32_t)SCx_UART; 
  
