philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/src/stm32w108xx_sc.c
  *(__IO uint32_t *) scxbase = Data;
}

/**
  * @brief  Returns the most recent received data by the SC1_UART peripheral. 
  * @param  SCx_UART: where x can be 1 to select the Serial controller peripheral.
  * @retval The value of the received data.
  */
uint8_t UART_ReceiveData(SC_UART_TypeDef* SCx_UART)
{
  uint32_t scxbase = 0x00;
  
  /* Check the parameters */
  assert_param(IS_UART_PERIPH(SCx_UART));
  
  scxbase = (uint32_t)SCx_UART; 
  
  return *(__IO uint32_t *) scxbase;
}

/**
  * @brief  Checks whether the specified SC1_UART flag is set or not.
  * @param  SCx_UART: where x can be 1 to select the Serial controller peripheral.
  * @param  UART_FLAG: specifies the SCx_UART flag to check.
  *   This parameter can be one of the following values:
  *     @arg UART_FLAG_CTS: Clear to send flag.
  *     @arg UART_FLAG_RXNE: Receive data register not empty flag.
  *     @arg UART_FLAG_TXE: Transmit data register empty flag.
  *     @arg UART_FLAG_ORE: OverRun Error flag.
  *     @arg UART_FLAG_FE: Framing Error flag.
  *     @arg UART_FLAG_PE: Parity Error flag.
  *     @arg UART_FLAG_IDLE: Idle Line detection flag.
  * @retval The new state of UART_FLAG (SET or RESET).
  */
FlagStatus UART_GetFlagStatus(SC_UART_TypeDef* SCx_UART, uint32_t UART_FLAG)
{
  FlagStatus bitstatus = RESET;
  
  /* Check the parameters */
  assert_param(IS_UART_PERIPH(SCx_UART));
  assert_param(IS_UART_GET_FLAG(UART_FLAG));
  
  if ((SCx_UART->UARTSR & UART_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Checks whether the specified SC1_UART pending interrupt is set or not.
  * @param  SCx_IT: where x can be 1 to select the Serial controller peripheral.
  * @param  UART_IT: specifies the pending interrupt to check.
  *   This parameter can be one of the following values:
  *     @arg UART_IT_PE: Parity error interrupt pending
  *     @arg UART_IT_FE: Frame error interrupt pending
  *     @arg UART_IT_UND: Underrun interrupt pending (to be checked)
  *     @arg UART_IT_OVR: Overrun interrupt pending
  *     @arg UART_IT_IDLE: Idle line detected interrupt pending
  *     @arg UART_IT_TXE: Transmit data register empty interrupt pending
  *     @arg UART_IT_RXNE: Data Register not empty interrupt pending
  * @retval The new state of UART_IT (SET or RESET).
  */
ITStatus UART_GetITStatus(SC_IT_TypeDef* SCx_IT, uint32_t UART_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t enablestatus = 0;
  /* Check the parameters */
  assert_param(IS_UART_IT_PERIPH(SCx_IT));
  assert_param(IS_UART_IT(UART_IT));

  enablestatus = (uint32_t)(SCx_IT->IER & UART_IT);
  if (((SCx_IT->ISR & UART_IT) != (uint32_t)RESET) && enablestatus)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Clears the SC1_UART interrupt pending bits.
  * @param  SCx_IT: where x can be 1 to select the Serial controller peripheral.
  * @param  UART_IT: specifies the pending interrupt to check.
  *   This parameter can be one of the following values:
  *     @arg UART_IT_PE: Parity error interrupt pending
  *     @arg UART_IT_FE: Frame error interrupt pending
  *     @arg UART_IT_UND: Underrun interrupt pending (to be checked)
  *     @arg UART_IT_OVR: Overrun interrupt pending
  *     @arg UART_IT_IDLE: Idle line detected interrupt pending
  *     @arg UART_IT_TXE: Transmit data register empty interrupt pending
  *     @arg UART_IT_RXNE: Data Register not empty interrupt pending
  * @retval None
  */
void UART_ClearITPendingBit(SC_IT_TypeDef* SCx_IT, uint32_t UART_IT)
{
  /* Check the parameters */
  assert_param(IS_UART_IT_PERIPH(SCx_IT));
  assert_param(IS_UART_IT(UART_IT));
  
  SCx_IT->ISR = UART_IT;
}

/**
  * @}
  */

/** @defgroup SC_Group2 Serial peripheral interface communication
 *  @brief   serial peripheral interface functions 
 *
@verbatim   
 ===============================================================================
           ##### Serial Peripheral Interface functions #####
 ===============================================================================
    [..] This section provides a set of functions allowing to handles the serial peripheral
         interface communication.

    (@) The SC1 and SC2 include an Serial Peripheral Interface (SPI) master/slave controller.

*** Initialization and Configuration ***
 =======================================
    [..] The GPIO pins that can be assigned to SPI interface are listed in the following tables:
     (##) SPI Master Mode:
   +-----------------------------------------------------------------+     
   |Parameter | Direction | GPIO configuration |  SC1 pin | SC2 pin  | 
   |----------|-----------|--------------------|----------|----------|             
   |   MOSI   |    Out    |  Alternate Output  |   PB1    |   PA0    |
   |          |           |    (push-pull)     |          |          |
   |----------|-----------|-------------------------------|----------|  
   |   MISO   |    In     |        Input       |   PB2    |   PA1    |
   |----------|-----------|--------------------|----------|----------|             
   |   SCLK   |    Out    | Alternate Output   |   PB3    |    PA2   |
   |          |           |      (push-pull)   |          |          |
   |          |           |  Special SCLK mode |          |          |
   +-----------------------------------------------------------------+
    (##) SPI Slave Mode:
   +-----------------------------------------------------------------+     
   |Parameter | Direction | GPIO configuration |  SC1 pin | SC2 pin  | 
   |----------|-----------|--------------------|----------|----------|             
   |   MOSI   |    In     |       Input        |   PB2    |   PA0    |
   |----------|-----------|-------------------------------|----------|  
   |   MISO   |    Out    |  Alternate Output  |   PB1    |   PA1    |
   |          |           |      (push-pull)   |          |          |
   |----------|-----------|--------------------|----------|----------|             
   |   SCLK   |    In     |       Input        |   PB3    |   PA2    |
   |----------|-----------|--------------------|----------|----------|             
   |   nSSEL  |    In     |       Input        |   PB4    |   PA3    |
   +-----------------------------------------------------------------+
    [..]  For the Serial Peripheral Interface mode these parameters can be configured: 
          (+) Mode.
          (+) Data Size.
          (+) Polarity.
          (+) Phase.
          (+) Baud Rate
          (+) First Bit Transmission
    [..] The SPI_Init() function follows the SPI configuration procedures for Master mode
         and Slave mode (details for these procedures are available in datasheet).

