philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/src/stm32w108xx_sc.c
*** Data transfers ***
 =====================

    [..] In reception, data are received and then stored into an internal Rx buffer while 
         In transmission, data are first stored into an internal Tx buffer before being 
         transmitted.

    [..] The read access of the SCx_DR register can be done using SPI_ReceiveData() 
         function and returns the Rx buffered value. Whereas a write access to the SCx_DR 
         can be done using SPI_SendData() function and stores the written data into 
         Tx buffer. 

 *** Interrupts and flags management ***
 =======================================
    [..] This subsection provides also a set of functions allowing to configure the 
         SPI Interrupts sources, Requests and check or clear the flags or pending bits status. 
         The user should identify which mode will be used in his application to 
         manage the communication: Polling mode, Interrupt mode or DMA mode(refer SC_Group4).

    [..] In Polling Mode, the SPI communication can be managed by these flags:
         (#) SPI_FLAG_TXE: to indicate the status of the transmit buffer register.
         (#) SPI_FLAG_RXNE: to indicate the status of the receive buffer register.
         (#) SPI_FLAG_IDLE: to indicate the status of the Idle Line.
         (#) SPI_FLAG_OVR: to indicate if an Overrun error occur.
    [..] In this Mode it is advised to use the following functions:
         (+) FlagStatus SPI_GetFlagStatus(SC_SPI_TypeDef* SCx_SPI, uint32_t SPI_FLAG).
    [..] In this mode all the SPI flags are cleared by hardware.

    [..] In Interrupt Mode, the SPI communication can be managed by 5 interrupt 
         sources and 5 pending bits:
         (+) Pending Bits:
             (##) SPI_IT_UND: to indicate the status of UnderRun Error interrupt.
             (##) SPI_IT_OVR: to indicate the status of OverRun Error interrupt.
             (##) SPI_IT_IDLE: to indicate the status of IDLE line detected interrupt.
             (##) SPI_IT_TXE: to indicate the status of the Transmit data register empty interrupt.
             (##) SPI_IT_RXNE: to indicate the status of the Data Register not empty interrupt.

         (+) Interrupt Source:
             (##) SPI_IT_UND: specifies the interrupt source for UnderRun Error pending interrupt.
             (##) SPI_IT_OVR: specifies the interrupt source for OverRun Error pending interrupt.
             (##) SPI_IT_IDLE: specifies the interrupt source for IDLE line detected pending interrupt.
             (##) SPI_IT_TXE: specifies the interrupt source for the Transmit data register empty pending interrupt.
             (##) SPI_IT_RXNE: specifies the interrupt source for the Data Register not empty pending interrupt.
             -@@- These parameters are coded in order to use them as interrupt 
                 source or as pending bits.
    [..] In this mode it is advised to use the following functions:
         (+) void SPI_ITConfig(SC_IT_TypeDef* SCx_IT, uint32_t SPI_IT, FunctionalState NewState).
         (+) ITStatus SPI_GetITStatus(SC_IT_TypeDef* SCx_IT, uint32_t SPI_IT).
         (+) void SPI_ClearITPendingBit(SC_IT_TypeDef* SCx_IT, uint32_t SPI_IT).

@endverbatim
  * @{
  */

/**
  * @brief  Deinitializes the SCx_SPI peripheral registers to their default reset values.
  * @param  SCx_SPI: where x can be 1 or 2 to select the Serial controller peripheral.
  * @retval None
  */
void SPI_DeInit(SC_SPI_TypeDef* SCx_SPI)
{
  /* Check the parameters */
  assert_param(IS_SPI_PERIPH(SCx_SPI));
  
  SCx_SPI->CR = 0;
  SCx_SPI->SPICR = 0;
  SCx_SPI->CRR1 = 0;
  SCx_SPI->CRR2 = 0;
}

/**
  * @brief  Initializes the SCx_SPI peripheral according to the specified 
  *         parameters in the SPI_InitStruct.
  * @param  SCx_SPI: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  SPI_InitStruct: pointer to a SPI_InitTypeDef structure that
  *         contains the configuration information for the specified SPI peripheral.
  * @retval None
  */
void SPI_Init(SC_SPI_TypeDef* SCx_SPI, SPI_InitTypeDef* SPI_InitStruct)
{
  uint32_t tmpreg = 0;
  uint8_t expvalue = 0, linvalue = 0, tmpexp = 0, tmplin = 0, idx = 0;
  uint32_t tempclockrate = 0, clockrate = 0, power = 0;
  
  /* Check the SPI parameters */
  assert_param(IS_SPI_PERIPH(SCx_SPI));
  assert_param(IS_SPI_MODE(SPI_InitStruct->SPI_Mode));
  assert_param(IS_SPI_CPOL(SPI_InitStruct->SPI_CPOL));
  assert_param(IS_SPI_CPHA(SPI_InitStruct->SPI_CPHA));
  assert_param(IS_SPI_CLOCK_RATE(SPI_InitStruct->SPI_ClockRate));
  assert_param(IS_SPI_FIRST_BIT(SPI_InitStruct->SPI_FirstBit));
  
  /* Get the SCx SPICR register value */
  tmpreg = SCx_SPI->SPICR;
  
  /* Clear Mode, LSBFirst, CPOL and CPHA bits */
  tmpreg &= SPICR_CLEAR_MASK;
  /*---------------------------- SCx_SPICR Configuration ---------------------*/
  /* Set MSTR bits according to SPI_Mode values */
  /* Set LSBFirst bit according to SPI_FirstBit value */
  /* Set CPOL bit according to SPI_CPOL value */
  /* Set CPHA bit according to SPI_CPHA value */
  tmpreg |= (uint32_t)((uint32_t)SPI_InitStruct->SPI_Mode | (uint32_t)SPI_InitStruct->SPI_CPOL |
                       (uint32_t)SPI_InitStruct->SPI_CPHA | (uint32_t)SPI_InitStruct->SPI_FirstBit);
  /* Write to SCx SPICR register */
  SCx_SPI->SPICR = tmpreg;
  
  /*---------------------------- SCx_CRRx Configuration ----------------------*/
  for(linvalue = 0x00; linvalue < 16; linvalue++)
  {
    for(expvalue = 0x00; expvalue < 16; expvalue++)
    {
      power = 0x01;
      for (idx=1; idx <= expvalue; idx++)
      {
        power*=2;
      }
      tempclockrate = power * (uint32_t)(linvalue + 1);
      
      if (tempclockrate == ((uint32_t)((uint32_t)CLK_GetClocksFreq()/(uint32_t)(2*(SPI_InitStruct->SPI_ClockRate)))))
      {
        SCx_SPI->CRR1 = (uint32_t)linvalue;
        SCx_SPI->CRR2 = (uint32_t)expvalue;
      }
      else
      {
        /* Check the clock rate error and write to CRRx */
        if((ABS((int32_t)tempclockrate - (int32_t)(CLK_GetClocksFreq()/(2*(SPI_InitStruct->SPI_ClockRate))))) < (ABS((int32_t)clockrate - (int32_t)(CLK_GetClocksFreq()/(2*(SPI_InitStruct->SPI_ClockRate))))))
        {
          clockrate = tempclockrate;
          tmplin = linvalue;
          tmpexp = expvalue;
        }
      }
    }
  }
  
  SCx_SPI->CRR1 = (uint32_t)tmplin;
  SCx_SPI->CRR2 = (uint32_t)tmpexp;
}

/**
  * @brief  Fills each SPI_InitStruct member with its default value.
  * @param  SPI_InitStruct: pointer to a SPI_InitTypeDef structure which will be initialized.
  * @retval None
  */
void SPI_StructInit(SPI_InitTypeDef* SPI_InitStruct)
{
  /*--------------- Reset SPI init structure parameters values ---------------*/
  /* Initialize the SPI_Mode member */
  SPI_InitStruct->SPI_Mode = SPI_Mode_Slave;
  /* Initialize the SPI_CPOL member */
  SPI_InitStruct->SPI_CPOL = SPI_CPOL_Low;
  /* Initialize the SPI_CPHA member */
  SPI_InitStruct->SPI_CPHA = SPI_CPHA_1Edge;
  /* Initialize the SPI_ClockRate member */
  SPI_InitStruct->SPI_ClockRate = 3000000;
  /* Initialize the SPI_FirstBit member */
  SPI_InitStruct->SPI_FirstBit = SPI_FirstBit_MSB;
}

/**
  * @brief  Configures the Receiver driven mode for the selected SCx_SPI (Master mode only).
  * @param  SCx_SPI: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  SPI_ReceiverMode: specifies the Receiver driven mode to be configured.
  *   This parameter can be one of the following values:
  *     @arg SPI_ReceiverMode_TxDataReady: Initiate transactions when transmit data is available
  *     @arg SPI_ReceiverMode_RxFIFOFree: Initiate transactions when receive buffer has space
  * @retval None
  */
void SPI_ReceiverModeConfig(SC_SPI_TypeDef* SCx_SPI, uint32_t SPI_ReceiverMode)
{
  /* Check the parameters */
  assert_param(IS_SPI_PERIPH(SCx_SPI));
  assert_param(IS_SPI_RECEIVER_DRIVEN_MODE(SPI_ReceiverMode));
  
  /* Clear RXMODE bit */
  SCx_SPI->SPICR &= (uint16_t)~((uint16_t)SC_SPICR_RXMODE);
  
