philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/src/stm32w108xx_sc.c
  /* Set new RXMODE bit value */
  SCx_SPI->SPICR |= SPI_ReceiverMode;
}

/**
  * @brief  Enables or disables the last byte repeat transmission feature  
  *         for the specified SCx_SPI peripheral (Slave mode only).
  * @param  SCx_SPI: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  NewState: new state of the SCx_SPI peripheral.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SPI_LastByteRepeatCmd(SC_SPI_TypeDef* SCx_SPI, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SPI_PERIPH(SCx_SPI));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the last byte repeat feature for the selected SPI by setting 
       the RPTEN bit 0 in the SPICR register */
    SCx_SPI->SPICR |= SC_SPICR_RPTEN;
  }
  else
  {
    /* Disable the last byte repeat feature for the selected SPI by clearing
       the RPTEN bit in the SPICR register */
    SCx_SPI->SPICR &= (uint16_t)~((uint16_t)SC_SPICR_RPTEN);
  }
}

/**
  * @brief  Enables or disables the specified SCx_SPI peripheral.
  * @param  SCx_SPI: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  NewState: new state of the SCx_SPI peripheral.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SPI_Cmd(SC_SPI_TypeDef* SCx_SPI, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SPI_PERIPH(SCx_SPI));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the selected SPI by setting the MODE bit 0 in the CR register */
    SCx_SPI->CR &= (uint16_t)~((uint16_t)SC_CR_MODE);
    SCx_SPI->CR |= SC_CR_MODE_1;
  }
  else
  {
    /* Disable the selected SPI by clearing the MODE bits in the CR register */
    SCx_SPI->CR &= (uint16_t)~((uint16_t)SC_CR_MODE);
  }
}

/**
  * @brief  Enables or disables the specified SCx_SPI interrupts.
  * @param  SCx_IT: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  SPI_IT: specifies the SCx_SPI interrupt source to be enabled or disabled. 
  *   This parameter can be one of the following values:
  *     @arg SPI_IT_UND: Underrun interrupt mask
  *     @arg SPI_IT_OVR: Overrun interrupt mask
  *     @arg SPI_IT_IDLE: Idle line detected interrupt mask
  *     @arg SPI_IT_TXE: Transmit data register empty interrupt mask
  *     @arg SPI_IT_RXNE: Data Register not empty interrupt mask
  * @param  NewState: new state of the specified SCx_SPI interrupt source.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SPI_ITConfig(SC_IT_TypeDef* SCx_IT, uint32_t SPI_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_I2C_SPI_DMA_IT_PERIPH(SCx_IT));
  assert_param(IS_SPI_IT(SPI_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the selected SPI interrupt */
    SCx_IT->IER |= SPI_IT;
  }
  else
  {
    /* Disable the selected SPI interrupt */
    SCx_IT->IER &= (uint16_t)~((uint16_t)SPI_IT);
  }
}

/**
  * @brief  Trigger event configuration to handle the specified SCx_SPI interrupt.
  * @param  SCx_IT: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  SPI_IT: specifies the SCx_SPI interrupt to be configured. 
  *   This parameter can be one of the following values:
  *     @arg SPI_IT_IDLE: Idle line detected interrupt
  *     @arg SPI_IT_TXE: Transmit data register empty interrupt
  *     @arg SPI_IT_RXNE: Data Register not empty interrupt
  * @param  TriggerEvent: Trigger event configuration of the specified SCx_SPI interrupt.
  *   This parameter can be one of the following values:
  *     @arg SC_TriggerEvent_Edge: The specified SCx_SPI interrupt will be generated on edge
  *     @arg SC_TriggerEvent_Level: The specified SCx_SPI interrupt will be generated on level
  * @retval None
  */
void SPI_TriggerEventConfig(SC_IT_TypeDef* SCx_IT, uint32_t SPI_IT, uint32_t TriggerEvent)
{
  /* Check the parameters */
  assert_param(IS_I2C_SPI_DMA_IT_PERIPH(SCx_IT));
  assert_param(IS_SPI_TRIGGEREVENT_IT(SPI_IT));
  assert_param(IS_SC_TRIGGEREVENT(TriggerEvent));
  
  if (TriggerEvent != SC_TriggerEvent_Edge)
  {
    /* The SPI_IT interrupt will be handled on level */
    SCx_IT->ICR |= SPI_IT;
  }
  else
  {
    /* The SPI_IT interrupt will be handled on edge */
    SCx_IT->ICR &= (uint16_t)~((uint16_t)SPI_IT);
  }
}

/**
  * @brief  Transmits a Data through the SCx_SPI peripheral.
  * @param  SCx_SPI: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  Data: Data to be transmitted.
  * @retval None
  */
void SPI_SendData(SC_SPI_TypeDef* SCx_SPI, uint8_t Data)
{
  uint32_t scxbase = 0x00;

  /* Check the parameters */
  assert_param(IS_SPI_PERIPH(SCx_SPI));

  scxbase = (uint32_t)SCx_SPI; 
  
  *(__IO uint32_t *) scxbase = Data;
}

/**
  * @brief  Returns the most recent received data by the SCx_SPI peripheral. 
  * @param  SCx_SPI: where x can be 1 or 2 to select the Serial controller peripheral.
  * @retval The value of the received data.
  */
uint8_t SPI_ReceiveData(SC_SPI_TypeDef* SCx_SPI)
{
  uint32_t scxbase = 0x00;
  
  /* Check the parameters */
  assert_param(IS_SPI_PERIPH(SCx_SPI));
  
  scxbase = (uint32_t)SCx_SPI; 

  return *(__IO uint32_t *) scxbase;
}

/**
  * @brief  Checks whether the specified SCx_SPI flag is set or not.
  * @param  SCx_SPI: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  SPI_FLAG: specifies the SCx_SPI flag to check.
  *   This parameter can be one of the following values:
  *     @arg SPI_FLAG_OVR:  OverRun Error flag.
  *     @arg SPI_FLAG_TXE:  Transmit data register empty flag.
  *     @arg SPI_FLAG_RXNE:  Receive data register not empty flag.
  *     @arg SPI_FLAG_IDLE:  IDLE line flag.
  * @retval The new state of SPI_FLAG (SET or RESET).
  */
FlagStatus SPI_GetFlagStatus(SC_SPI_TypeDef* SCx_SPI, uint32_t SPI_FLAG)
{
  FlagStatus bitstatus = RESET;
  
  /* Check the parameters */
  assert_param(IS_SPI_PERIPH(SCx_SPI));
  assert_param(IS_SPI_GET_FLAG(SPI_FLAG));
  
  if ((SCx_SPI->SPISR & SPI_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Checks whether the specified SCx_SPI pending interrupt is set or not.
  * @param  SCx_IT: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  SPI_IT: specifies the SCx_SPI pending interrupt to check.
  *   This parameter can be one of the following values:
  *     @arg SPI_IT_UND: Underrun interrupt pending
  *     @arg SPI_IT_OVR: Overrun interrupt pending
  *     @arg SPI_IT_IDLE: Idle line detected interrupt pending
  *     @arg SPI_IT_TXE: Transmit data register empty interrupt pending
  *     @arg SPI_IT_RXNE: Data Register not empty interrupt pending
  * @retval The new state of SPI_IT (SET or RESET).
  */
ITStatus SPI_GetITStatus(SC_IT_TypeDef* SCx_IT, uint32_t SPI_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t enablestatus = 0;
  
  /* Check the parameters */
  assert_param(IS_I2C_SPI_DMA_IT_PERIPH(SCx_IT));
  assert_param(IS_SPI_IT(SPI_IT));
  
  enablestatus = (uint32_t)(SCx_IT->IER & SPI_IT);
  if (((SCx_IT->ISR & SPI_IT) != (uint32_t)RESET) && enablestatus)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Clears the SCx_SPI interrupt pending bits.
  * @param  SCx_IT: where x can be 1 to select the Serial controller peripheral.
  * @param  SPI_IT: specifies the SCx_SPI pending interrupt to check.
  *   This parameter can be one of the following values:
  *     @arg SPI_IT_UND: Underrun interrupt pending
  *     @arg SPI_IT_OVR: Overrun interrupt pending
  *     @arg SPI_IT_IDLE: Idle line detected interrupt pending
  *     @arg SPI_IT_TXE: Transmit data register empty interrupt pending
  *     @arg SPI_IT_RXNE: Data Register not empty interrupt pending
  * @retval None
  */
void SPI_ClearITPendingBit(SC_IT_TypeDef* SCx_IT, uint32_t SPI_IT)
{
  /* Check the parameters */
  assert_param(IS_I2C_SPI_DMA_IT_PERIPH(SCx_IT));
  assert_param(IS_SPI_IT(SPI_IT));
  
  SCx_IT->ISR = SPI_IT;
}

/**
  * @}
  */

/** @defgroup SC_Group3 Inter-Integrated Circuit communication
 *  @brief   inter-integrated circuit functions 
 *
@verbatim   
 ===============================================================================
           ##### Inter-Integrated Circuit functions #####
 ===============================================================================
    [..] This section provides a set of functions allowing to handles the Inter-Integrated 
         Circuit communication.

    (@) The SC1 and SC2 include an Inter-integrated circuit interface (I2C) master controller.

*** Initialization and Configuration ***
 =======================================

    [..] The GPIO pins that can be assigned to I2C interface are listed in the following table:
   +------------------------------------------------------------------+     
   |Parameter | Direction | GPIO configuration |  SC1 pin |  SC2 pin  |
   |----------|-----------|--------------------|----------|-----------|             
   |    SDA   |  In/Out   |  Alternate Output  |   PB1    |   PA1     |
   |          |           |    (open drain)    |          |           |
   |----------|-----------|-------------------------------------------|  
   |    SCL   |  In/Out   |  Alternate Output  |   PB2    |   PA2     |
   |          |           |    (open drain)    |          |           |
   +------------------------------------------------------------------+    

