philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/src/stm32w108xx_sc.c
    [..] For the Inter-Integrated Circuit mode only the Baud Rate parameter can be configured: 
    
    [..] The I2C_Init() function follows the I2C configuration procedure (this procedure 
         is available in datasheet).

    [..] The generate START and STOP can be done respectively using I2C_GenerateSTART() and 
         I2C_GenerateSTOP() functions.

    [..] The command for the ACK generation can be done I2C_AcknowledgeConfig() function.

*** Data transfers ***
 =====================
    [..] To initiate a transmit segment, write the data to the SCx_DR data register,
         then set the BTE bit in the SCx_I2CCR1 register, and finally wait until 
         the BTE bit is clear and the BTF bit in the SCx_I2CSR register, these steps
         can be done using I2C_SendData() function. Alternatively to initiate the reception
         set the BRE bit in the SCx_I2CCR1 register and keep waiting until the BRE bit 
         is clear and the BTF bit in the SCx_I2CSR register is set then read the 
         Rx buffered value, these steps can be done using I2C_ReceiveData() function.

    [..] The Master transmit address byte to select the slave device in transmitter 
         or in receiver mode can be done using the I2C_Send7bitAddress() function

 *** Interrupts and flags management ***
 =======================================
    [..] This subsection provides also a set of functions allowing to configure the 
         I2C Interrupts sources, Requests and check or clear the flags or pending bits status. 
         The user should identify which mode will be used in his application to 
         manage the communication: Polling mode, Interrupt mode.

    [..] In Polling Mode, the I2C communication can be managed by 4 flags:
        (#) I2C_FLAG_NACK: to indicate the status of the not acknowledge flag.
        (#) I2C_FLAG_BTF: to indicate the status of the byte transfer finished flag.
        (#) I2C_FLAG_BRF: to indicate the status of the byte receive finished flag.
        (#) I2C_FLAG_CMDFIN: to indicate the status of the command finished flag.
      
    [..] In this Mode it is advised to use the following functions:
        (+) FlagStatus I2C_GetFlagStatus(SC_I2C_TypeDef* SCx_I2C, uint32_t I2C_FLAG).
    [..] In this mode all the I2C flags are cleared by hardware.

  *** Interrupt Mode ***
  ======================
    [..] In Interrupt Mode, the I2C communication can be managed by 4 interrupt sources
         and 4 pending bits:

    [..] Interrupt Source:
        (#) I2C_IT_NACK: specifies the interrupt source for the not acknowledge interrupt.
        (#) I2C_IT_CMDFIN: specifies the interrupt source for the command finished interrupt.
        (#) I2C_IT_BTF: specifies the interrupt source for the byte transfer finished interrupt.
        (#) I2C_IT_BRF: specifies the interrupt source for the byte receive finished interrupt.
        
    [..] Pending Bits:
        (#) I2C_IT_NACK: to indicate the status of not acknowledge pending interrupt.
        (#) I2C_IT_CMDFIN: to indicate the status of command finished pending interrupt.
        (#) I2C_IT_BTF: to indicate the status of byte transfer finished pending interrupt.
        (#) I2C_IT_BRF: to indicate the status of byte receive finished pending interrupt.
        
    [..] In this Mode it is advised to use the following functions:
        (+) void I2C_ClearITPendingBit(SC_IT_TypeDef* SCx_IT, uint32_t I2C_IT).
        (+) ITStatus I2C_GetITStatus(SC_IT_TypeDef* SCx_IT, uint32_t I2C_IT).

@endverbatim
  * @{
  */

/**
  * @brief  Deinitializes the SCx_I2C peripheral registers to their default reset values.
  * @param  SCx_I2C: where x can be 1 or 2 to select the Serial controller peripheral.
  * @retval None
  */
void I2C_DeInit(SC_I2C_TypeDef* SCx_I2C)
{
  /* Check the parameters */
  assert_param(IS_I2C_PERIPH(SCx_I2C));
  
  SCx_I2C->CR = 0;
  SCx_I2C->I2CCR1 = 0;
  SCx_I2C->I2CCR2 = 0;
  SCx_I2C->CRR1 = 0;
  SCx_I2C->CRR2 = 0;
}

/**
  * @brief  Initializes the SCx_I2C peripheral according to the specified
  *         parameters in the I2C_InitStruct.
  * @param  SCx_I2C: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  I2C_InitStruct: pointer to a I2C_InitTypeDef structure that
  *         contains the configuration information for the specified SCx_I2C peripheral.
  * @retval None
  */
void I2C_Init(SC_I2C_TypeDef* SCx_I2C, I2C_InitTypeDef* I2C_InitStruct)
{
  uint8_t expvalue = 0, lin = 0, tmpexp = 0, tmplin = 0, idx = 0;
  uint32_t tempclockrate = 0, clockrate = 0, power = 0;
  
  /* Check the parameters */
  assert_param(IS_I2C_PERIPH(SCx_I2C));
  assert_param(IS_I2C_CLOCK_RATE(I2C_InitStruct->I2C_ClockRate));
  
  /*---------------------------- SCx_CRRx Configuration ----------------------*/
  /*---------------------------- SCx_CRRx Configuration ----------------------*/
  for(lin = 0x00; lin < 16; lin++)
  {
    for(expvalue = 0x00; expvalue < 16; expvalue++)
    {
      power = 0x01;
      for (idx=1; idx <= expvalue; idx++)
      {
        power*=2;
      }
      tempclockrate = power * (uint32_t)(lin + 1);
      
      if (tempclockrate == ((uint32_t)((uint32_t)CLK_GetClocksFreq()/(uint32_t)(2*(I2C_InitStruct->I2C_ClockRate)))))
      {
        SCx_I2C->CRR1 = (uint32_t)lin;
        SCx_I2C->CRR2 = (uint32_t)expvalue;
      }
      else
      {
        /* Check the clock rate error and write to CRRx */
        if((ABS((int32_t)tempclockrate - (int32_t)(CLK_GetClocksFreq()/(2*(I2C_InitStruct->I2C_ClockRate))))) < (ABS((int32_t)clockrate - (int32_t)(CLK_GetClocksFreq()/(2*(I2C_InitStruct->I2C_ClockRate))))))
        {
          clockrate = tempclockrate;
          tmplin = lin;
          tmpexp = expvalue;
        }
      }
    }
  }
  
  SCx_I2C->CRR1 = (uint32_t)tmplin;
  SCx_I2C->CRR2 = (uint32_t)tmpexp;
}

/**
  * @brief  Fills each I2C_InitStruct member with its default value.
  * @param  I2C_InitStruct: pointer to a I2C_InitTypeDef structure which will be initialized.
  * @retval None
  */
void I2C_StructInit(I2C_InitTypeDef* I2C_InitStruct)
{
  /*--------------- Reset I2C init structure parameters values ---------------*/
  
  /* Initialize the I2C_ClockRate member */
  I2C_InitStruct->I2C_ClockRate = 400000;
}

/**
  * @brief  Generates SCx_I2C communication START condition.
  * @param  SCx_I2C: where x can be 1 or 2 to select the Serial controller peripheral.
  * @retval None
  */
void I2C_GenerateSTART(SC_I2C_TypeDef* SCx_I2C)
{
  /* Check the parameters */
  assert_param(IS_I2C_PERIPH(SCx_I2C));
  
