philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/src/stm32w108xx_sc.c
  /* Generate a START condition */
  SCx_I2C->I2CCR1 |= SC_I2CCR1_START;
}  

/**
  * @brief  Generates SCx_I2C communication STOP condition.
  * @param  SCx_I2C: where x can be 1 or 2 to select the Serial controller peripheral.
  * @retval None
  */
void I2C_GenerateSTOP(SC_I2C_TypeDef* SCx_I2C)
{
  /* Check the parameters */
  assert_param(IS_I2C_PERIPH(SCx_I2C));
  
  /* Generate a STOP condition */
  SCx_I2C->I2CCR1 |= SC_I2CCR1_STOP;
} 

/**
  * @brief  Generates SCx_I2C communication Acknowledge.
  * @param  SCx_I2C: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  NewState: new state of the Acknowledge.
  *   This parameter can be: ENABLE or DISABLE.  
  * @retval None
  */
void I2C_AcknowledgeConfig(SC_I2C_TypeDef* SCx_I2C, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_I2C_PERIPH(SCx_I2C));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable ACK generation */
    SCx_I2C->I2CCR2 |= SC_I2CCR2_ACK; 
  }
  else
  {
    /* Enable NACK generation */
    SCx_I2C->I2CCR2 &= (uint32_t)~((uint32_t)SC_I2CCR2_ACK);
  }
}

/**
  * @brief  Transmits the address byte to select the slave device.
  * @param  SCx_I2C: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  Address: specifies the slave address which will be transmitted
  * @param  I2C_Direction: specifies whether the SCx_I2C device will be a
  *   Transmitter or a Receiver. This parameter can be one of the following values
  *     @arg I2C_Direction_Transmitter: Transmitter mode
  *     @arg I2C_Direction_Receiver: Receiver mode
  * @retval None.
  */
void I2C_Send7bitAddress(SC_I2C_TypeDef* SCx_I2C, uint8_t Address, uint8_t I2C_Direction)
{
  uint32_t scxbase = 0x00;
  /* Check the parameters */
  assert_param(IS_I2C_PERIPH(SCx_I2C));
  assert_param(IS_I2C_DIRECTION(I2C_Direction));
  /* Test on the direction to set/reset the read/write bit */
  if (I2C_Direction != I2C_Direction_Transmitter)
  {
    /* Set the address bit0 for read */
    Address |= OAR1_ADD0_Set;
  }
  else
  {
    /* Reset the address bit0 for write */
    Address &= OAR1_ADD0_Reset;
  }
  
  scxbase = (uint32_t)SCx_I2C; 
  /* Send the address */
  *(__IO uint32_t *) scxbase = Address;
  
  /* Enable the byte Send */
  SCx_I2C->I2CCR1 |= SC_I2CCR1_BTE;
  
  while ((SCx_I2C->I2CCR1 & SC_I2CCR1_BTE) != 0x00)
  {}
}

/**
  * @brief  Transmits a Data through the SCx_I2C peripheral.
  * @param  SCx_I2C: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  Data: Data to be transmitted.
  * @retval None
  */
void I2C_SendData(SC_I2C_TypeDef* SCx_I2C, uint8_t Data)
{
  uint32_t scxbase = 0x00;

  /* Check the parameters */
  assert_param(IS_I2C_PERIPH(SCx_I2C));

  scxbase = (uint32_t)SCx_I2C; 
  
  *(__IO uint32_t *) scxbase = Data;
  
  /* Enable the byte Send */
  SCx_I2C->I2CCR1 |= SC_I2CCR1_BTE;
  
  while ((SCx_I2C->I2CCR1 & SC_I2CCR1_BTE) != 0x00)
  {}
  while ((SCx_I2C->I2CSR & SC_I2CSR_BTF) == 0x00)
  {}
}

/**
  * @brief  Returns the most recent received data by the SCx_I2C peripheral. 
  * @param  SCx_I2C: where x can be 1 or 2 to select the Serial controller peripheral.
  * @retval The value of the received data.
  */
uint8_t I2C_ReceiveData(SC_I2C_TypeDef* SCx_I2C)
{
  uint32_t scxbase = 0x00;
  
  /* Check the parameters */
  assert_param(IS_I2C_PERIPH(SCx_I2C));
  
  scxbase = (uint32_t)SCx_I2C; 

  /* Enable the byte Receive */
  SCx_I2C->I2CCR1 |= SC_I2CCR1_BRE;
  
  while ((SCx_I2C->I2CCR1 & SC_I2CCR1_BRE) != 0x00)
  {}
  while ((SCx_I2C->I2CSR & SC_I2CSR_BRF) == 0x00)
  {}

  return *(__IO uint32_t *) scxbase;
}

/**
  * @brief  Enables or disables the specified SCx_I2C peripheral.
  * @param  SCx_I2C: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  NewState: new state of the SCx_I2C peripheral.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C_Cmd(SC_I2C_TypeDef* SCx_I2C, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_I2C_PERIPH(SCx_I2C));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the selected I2C by setting the MODE bits in the CR register */
    SCx_I2C->CR |= SC_CR_MODE;
  }
  else
  {
    /* Disable the selected I2C by clearing the MODE bits in the CR register */
    SCx_I2C->CR &= (uint16_t)~((uint16_t)SC_CR_MODE);
  }
}

/**
  * @brief  Enables or disables the specified SCx_I2C interrupts.
  * @param  SCx_IT: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  I2C_IT: specifies the SCx_I2C interrupt source to be enabled or disabled. 
  *   This parameter can be one of the following values:
  *     @arg I2C_IT_NACK: Not acknowledge interrupt mask
  *     @arg I2C_IT_CMDFIN: Command finished interrupt mask
  *     @arg I2C_IT_BTF: Byte transfer finished interrupt mask
  *     @arg I2C_IT_BRF: Byte receive finished interrupt mask
  * @param  NewState: new state of the specified SCx_I2C interrupt source.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C_ITConfig(SC_IT_TypeDef* SCx_IT, uint32_t I2C_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_I2C_SPI_DMA_IT_PERIPH(SCx_IT));
  assert_param(IS_I2C_IT(I2C_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the selected I2C interrupt */
    SCx_IT->IER |= I2C_IT;
  }
  else
  {
    /* Disable the selected I2C interrupt */
    SCx_IT->IER &= (uint16_t)~((uint16_t)I2C_IT);
  }
}

/**
  * @brief  Checks whether the specified I2C flag is set or not.
  * @param  SCx_I2C: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  I2C_FLAG: specifies the SCx_I2C flag to check.
  *   This parameter can be one of the following values:
  *     @arg I2C_FLAG_NACK: Not acknowledge flag
  *     @arg I2C_FLAG_BTF: Byte transfer finished flag
  *     @arg I2C_FLAG_BRF: Byte receive finished flag
  *     @arg I2C_FLAG_CMDFIN: Command finished flag
  * @retval The new state of I2C_FLAG (SET or RESET).
  */
FlagStatus I2C_GetFlagStatus(SC_I2C_TypeDef* SCx_I2C, uint32_t I2C_FLAG)
{
  FlagStatus bitstatus = RESET;
  
  /* Check the parameters */
  assert_param(IS_I2C_PERIPH(SCx_I2C));
  assert_param(IS_I2C_GET_FLAG(I2C_FLAG));
  
  if ((SCx_I2C->I2CSR & I2C_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Checks whether the specified SCx_I2C pending interrupt is set or not.
  * @param  SCx_IT: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  I2C_IT: specifies the SCx_I2C interrupt pending to check.
  *   This parameter can be one of the following values:
  *     @arg I2C_IT_NACK: Not acknowledge interrupt pending
  *     @arg I2C_IT_CMDFIN: Command finished interrupt pending
  *     @arg I2C_IT_BTF: Byte transfer finished interrupt pending
  *     @arg I2C_IT_BRF: Byte receive finished interrupt pending
  * @retval The new state of I2C_IT (SET or RESET).
  */
ITStatus I2C_GetITStatus(SC_IT_TypeDef* SCx_IT, uint32_t I2C_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t enablestatus = 0;
  
  /* Check the parameters */
  assert_param(IS_I2C_SPI_DMA_IT_PERIPH(SCx_IT));
  assert_param(IS_I2C_IT(I2C_IT));
  
  enablestatus = (uint32_t)(SCx_IT->IER & I2C_IT);
  if (((SCx_IT->ISR & I2C_IT) != (uint32_t)RESET) && enablestatus)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Clears the SCx_I2C interrupt pending bits.
  * @param  SCx_IT: where x can be 1 to select the Serial controller peripheral.
  * @param  I2C_IT: specifies the SCx_I2C interrupt pending to check.
  *   This parameter can be one of the following values:
  *     @arg I2C_IT_NACK: Not acknowledge interrupt pending
  *     @arg I2C_IT_CMDFIN: Command finished interrupt pending
  *     @arg I2C_IT_BTF: Byte transfer finished interrupt pending
  *     @arg I2C_IT_BRF: Byte receive finished interrupt pending
  * @retval None
  */
void I2C_ClearITPendingBit(SC_IT_TypeDef* SCx_IT, uint32_t I2C_IT)
{
  /* Check the parameters */
  assert_param(IS_I2C_SPI_DMA_IT_PERIPH(SCx_IT));
  assert_param(IS_I2C_IT(I2C_IT));
  
  SCx_IT->ISR = I2C_IT;
}

/**
  * @}
  */

/** @defgroup SC_Group4 DMA transfers management
 *  @brief   DMA transfers management functions 
 *
@verbatim   
 ===============================================================================
                 ##### DMA transfers management functions #####
 ===============================================================================
    [..] This section provides a set of functions that can be used only in DMA mode.
   
    (@) The SC1 and SC2 include a DMA controller that can be used to manage the UART
        and SPI communications.

*** Initialization and Configuration ***
 =======================================
    [..] For the DMA mode these parameters can be configured: 
         (+) Begin address buffer A.
         (+) End address buffer A.
         (+) Begin address buffer B.
         (+) End address buffer B.

