philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/src/stm32w108xx_sc.c
    [..] The DMA_Init() function follows the DMA configuration procedure.

*** Data transfers ***
 =====================
    [..] In DMA Mode, the UART and SPI communications can be managed by 4 DMA Channel 
         requests:
         (#) DMA_ChannelLoad_BTx: specifies the DMA transmit channel buffer B transfer request.
         (#) DMA_ChannelLoad_ATx: specifies the DMA transmit channel buffer A transfer request.
         (#) DMA_ChannelLoad_BRx: specifies the DMA receive channel buffer B transfer request.
         (#) DMA_ChannelLoad_ARx: specifies the DMA receive channel buffer A transfer request.
    [..] In this Mode it is advised to use the following function to load and enables the specified DMA channel:
        (+) void SC_DMA_ChannelLoadEnable(SC_DMA_TypeDef* SCx_DMA, uint32_t Channelxy).

*** Interrupts and flags management ***
 =======================================
    [..] This subsection provides also a set of functions allowing to configure the 
         DMA Interrupts sources, Requests and check or clear the flags or pending bits status. 
         The user should identify which mode will be used in his application to 
         manage the communication: Polling mode, Interrupt mode.

    [..] In Polling Mode, the DMA communication can be managed by 4 flags:
        (#) DMA_FLAG_RXAACK: to indicate the status of the DMA receive buffer A acknowledge flag.
        (#) DMA_FLAG_RXBACK: to indicate the status of the DMA receive buffer B acknowledge flag.
        (#) DMA_FLAG_TXAACK: to indicate the status of the DMA transmit buffer A acknowledge flag.
        (#) DMA_FLAG_TXBACK: to indicate the status of the DMA transmit buffer B acknowledge flag.
        (#) DMA_FLAG_OVRA: to indicate the status of the DMA buffer B overrun flag.
        (#) DMA_FLAG_OVRB: to indicate the status of the DMA buffer B overrun flag.
        (#) DMA_FLAG_PEA: to indicate the status of the DMA Parity error A flag.
        (#) DMA_FLAG_PEB: to indicate the status of the DMA Parity error B flag.
        (#) DMA_FLAG_FEA: to indicate the status of the DMA Frame error A flag.
        (#) DMA_FLAG_FEB: to indicate the status of the DMA Frame error B flag.
        (#) DMA_FLAG_NSSS: to indicate the status of the status of the receive count flag.
    [..] In this Mode it is advised to use the following functions:
        (+) FlagStatus SC_DMA_GetFlagStatus(SC_DMA_TypeDef* SCx_DMA, uint32_t DMA_FLAG).
    [..] In this mode all the DMA flags are cleared by hardware.

  *** Interrupt Mode ***
  ======================
    [..] In Interrupt Mode, the DMA communication can be managed by 4 interrupt sources
         and 4 pending bits:

    [..] Interrupt Source:
        (#) DMA_IT_TXULODB: specifies the interrupt source for the transmit buffer B unloaded interrupt.
        (#) DMA_IT_TXULODA: specifies the interrupt source for the transmit buffer A unloaded interrupt.
        (#) DMA_IT_RXULODB: specifies the interrupt source for the receive buffer B unloaded interrupt.
        (#) DMA_IT_RXULODA: specifies the interrupt source for the receive buffer A unloaded interrupt.
        
    [..] Pending Bits:
        (#) DMA_IT_TXULODB: to indicate the status of transmit buffer B unloaded pending interrupt.
        (#) DMA_IT_TXULODA: to indicate the status of transmit buffer A unloaded pending interrupt.
        (#) DMA_IT_RXULODB: to indicate the status of receive buffer B unloaded pending interrupt.
        (#) DMA_IT_RXULODA: to indicate the status of receive buffer A unloaded pending interrupt.
        
    [..] In this Mode it is advised to use the following functions:
        (+) ITStatus SC_DMA_GetITStatus(SC_IT_TypeDef* SCx_IT, uint32_t DMA_IT).
        (+) SC_DMA_ClearITPendingBit(SC_IT_TypeDef* SCx_IT, uint32_t DMA_IT).

@endverbatim
  * @{
  */

/**
  * @brief  Reset the specified SCx_DMA Channely buffer addresses.
  * @param  SCx_DMA: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  Channely: specifies the SCx_DMA channel to be enabled. 
  *   This parameter can be one of the following values:
  *     @arg DMA_ChannelReset_Tx: DMA reset transmit channels mask
  *     @arg DMA_ChannelReset_Rx: DMA reset receive channels mask
  * @retval None
  */
void SC_DMA_ChannelReset(SC_DMA_TypeDef* SCx_DMA, uint32_t Channely)
{
  /* Check the parameters */
  assert_param(IS_DMA_PERIPH(SCx_DMA));
  assert_param(IS_DMA_CHANNEL_RESET(Channely));
  
  /* Reset the selected SCx_DMA Channelx */
  SCx_DMA->DMACR |= Channely;
}

/**
  * @brief  Initializes the SCx_DMA Channely according to the specified
  *         parameters in the DMA_InitStruct.
  * @param  SCx_DMA_Channely: where x can be 1 or 2 to select the SCx_DMA and
  *   y can be Tx or Rx to select the SCx_DMA Channel.
  * @param  SC_DMA_InitStruct: pointer to a DMA_InitTypeDef structure that
  *         contains the configuration information for the specified DMA Channel.
  * @retval None
  */
void SC_DMA_Init(SC_DMA_Channel_TypeDef* SCx_DMA_Channely, SC_DMA_InitTypeDef* SC_DMA_InitStruct)
{
  /* Check the parameters */
  assert_param(IS_DMA_CHANNEL_PERIPH(SCx_DMA_Channely));
  assert_param(IS_DMA_VALID_ADDRESS(SC_DMA_InitStruct->DMA_BeginAddrA));
  assert_param(IS_DMA_VALID_ADDRESS(SC_DMA_InitStruct->DMA_EndAddrA));
  assert_param(IS_DMA_VALID_ADDRESS(SC_DMA_InitStruct->DMA_BeginAddrB));
  assert_param(IS_DMA_VALID_ADDRESS(SC_DMA_InitStruct->DMA_EndAddrB));
  
/*---------------------- SCx_DMA Channely DMABEGADDAR Configuration ----------*/
  /* Write to SCx_DMA Channely Begin address A register */
  SCx_DMA_Channely->DMABEGADDAR = SC_DMA_InitStruct->DMA_BeginAddrA;
  
  /*---------------------- SCx_DMA Channely DMAENDADDAR Configuration --------*/
  /* Write to SCx_DMA Channely end address A register */
  SCx_DMA_Channely->DMAENDADDAR = SC_DMA_InitStruct->DMA_EndAddrA;
  
  /*---------------------- SCx_DMA Channely DMABEGADDBR Configuration --------*/
  /* Write to SCx_DMA Channely Begin address B register */
  SCx_DMA_Channely->DMABEGADDBR = SC_DMA_InitStruct->DMA_BeginAddrB;
  
  /*---------------------- SCx_DMA Channely DMAENDADDBR Configuration --------*/
  /* Write to SCx_DMA Channely end address B register */
  SCx_DMA_Channely->DMAENDADDBR = SC_DMA_InitStruct->DMA_EndAddrB;
}

/**
  * @brief  Fills each DMA_InitStruct member with its default value.
  * @param  SC_DMA_InitStruct: pointer to a DMA_InitTypeDef structure which will be initialized.
  * @retval None
  */
void SC_DMA_StructInit(SC_DMA_InitTypeDef* SC_DMA_InitStruct)
{
  /*--------------- Reset DMA init structure parameters values ---------------*/
  /* Initialize the SCx_DMA_Channely begin address A member */
  SC_DMA_InitStruct->DMA_BeginAddrA = 0x20000000;
  /* Initialize the SCx_DMA_Channely end address A member */
  SC_DMA_InitStruct->DMA_EndAddrA = 0x20000000;
  /* Initialize the SCx_DMA_Channely begin address B member */
  SC_DMA_InitStruct->DMA_BeginAddrB = 0x20000000;
  /* Initialize the SCx_DMA_Channely end address B member */
  SC_DMA_InitStruct->DMA_EndAddrB = 0x20000000;
}

/**
  * @brief  Enables or disables the specified SCx_DMA interrupts.
  * @param  SCx_IT: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  DMA_IT: specifies the SCx_DMA interrupt source to be enabled or disabled. 
  *   This parameter can be one of the following values:
  *     @arg DMA_IT_TXULODB: DMA transmit buffer B unloaded interrupt mask
  *     @arg DMA_IT_TXULODA: DMA transmit buffer A unloaded interrupt mask
  *     @arg DMA_IT_RXULODB: DMA receive buffer B unloaded interrupt mask
  *     @arg DMA_IT_RXULODA: DMA receive buffer A unloaded interrupt mask
  * @param  NewState: new state of the specified SCx_DMA interrupt source.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SC_DMA_ITConfig(SC_IT_TypeDef* SCx_IT, uint32_t DMA_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_I2C_SPI_DMA_IT_PERIPH(SCx_IT));
  assert_param(IS_DMA_IT(DMA_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the selected DMA interrupt */
    SCx_IT->IER |= DMA_IT;
  }
  else
  {
    /* Disable the selected DMA interrupt */
    SCx_IT->IER &= (uint16_t)~((uint16_t)DMA_IT);
  }
}

/**
  * @brief  Load and Enables the specified SCx_DMA Channelxy buffers addresses.
  * @param  SCx_DMA: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  Channelxy: specifies the SCx_DMA channel to be enabled. 
  *   This parameter can be one of the following values:
  *     @arg DMA_ChannelLoad_BTx: DMA transmit channel buffer B mask
  *     @arg DMA_ChannelLoad_ATx: DMA transmit channel buffer A mask
  *     @arg DMA_ChannelLoad_BRx: DMA receive channel buffer B mask
  *     @arg DMA_ChannelLoad_ARx: DMA receive channel buffer A mask
  * @retval None
  */
void SC_DMA_ChannelLoadEnable(SC_DMA_TypeDef* SCx_DMA, uint32_t Channelxy)
{
  /* Check the parameters */
  assert_param(IS_DMA_PERIPH(SCx_DMA));
  assert_param(IS_DMA_CHANNEL_LOAD(Channelxy));
  
