philpem/STM32_SPL/STM32W108xx_StdPeriph_Driver/src/stm32w108xx_sc.c
  /* Load the selected SCx_DMA Channelxy buffer addresses and allow the DMA controller
     to start processing */
  SCx_DMA->DMACR |= Channelxy;
}

/**
  * @brief  Returns the most recent value for the specific SCx_DMA counter register.
  * @param  SCx_DMA: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  Counter: specifies the SCx_DMA counter register to be read. 
  *   This parameter can be one of the following values:
  *     @arg DMA_Counter_RXCNTA: DMA receive counter A register
  *     @arg DMA_Counter_RXCNTB: DMA receive counter B register
  *     @arg DMA_Counter_TXCNT: DMA transmit counter register
  *     @arg DMA_Counter_RXCNTSAVED: DMA receive counter saved register
  * @retval The DMA register counter value.
  */
uint32_t SC_DMA_GetCounter(SC_DMA_TypeDef* SCx_DMA, uint32_t Counter)
{
  uint32_t scxbase = 0x00;
  
  /* Check the parameters */
  assert_param(IS_DMA_PERIPH(SCx_DMA));
  assert_param(IS_DMA_COUNTER(Counter));
  
  scxbase = (uint32_t)SCx_DMA; 
  scxbase += Counter;

  return *(__IO uint32_t *) scxbase;
}

/**
  * @brief  Returns the specified SCx_DMA receive error register.
  * @param  SCx_DMA: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  RegisterError: specifies the SCx_DMA receiver error register to be read. 
  *   This parameter can be one of the following values:
  *     @arg DMA_ReceiverError_CNTA: DMA receive error register A
  *     @arg DMA_ReceiverError_CNTB: DMA receive error register B
  * @retval The DMA receive error register value.
  */
uint32_t SC_DMA_GetReceiverErrorOffset(SC_DMA_TypeDef* SCx_DMA, uint32_t RegisterError)
{
  uint32_t scxbase = 0x00;
  
  /* Check the parameters */
  assert_param(IS_DMA_PERIPH(SCx_DMA));
  assert_param(IS_DMA_RECEIVER_ERROR(RegisterError));
  
  scxbase = (uint32_t)SCx_DMA; 
  scxbase += RegisterError;

  return *(__IO uint32_t *) scxbase;
}

/**
  * @brief  Checks whether the specified DMA flag is set or not.
  * @param  SCx_DMA: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  DMA_FLAG: specifies the SCx_DMA flag to check.
  *   This parameter can be one of the following values:
  *     @arg DMA_FLAG_RXAACK: DMA receive buffer A acknowledge flag
  *     @arg DMA_FLAG_RXBACK: DMA receive buffer B acknowledge flag
  *     @arg DMA_FLAG_TXAACK: DMA transmit buffer A acknowledge flag
  *     @arg DMA_FLAG_TXBACK: DMA transmit buffer B acknowledge flag
  *     @arg DMA_FLAG_OVRA: DMA buffer B overrun flag
  *     @arg DMA_FLAG_OVRB: DMA buffer B overrun flag
  *     @arg DMA_FLAG_PEA: DMA Parity error A flag
  *     @arg DMA_FLAG_PEB: DMA Parity error B flag
  *     @arg DMA_FLAG_FEA: DMA Frame error A flag
  *     @arg DMA_FLAG_FEB: DMA Frame error B flag
  *     @arg DMA_FLAG_NSSS: DMA Status of the receive count flag
  * @retval The new state of DMA_FLAG (SET or RESET).
  */
FlagStatus SC_DMA_GetFlagStatus(SC_DMA_TypeDef* SCx_DMA, uint32_t DMA_FLAG)
{
  FlagStatus bitstatus = RESET;
  
  /* Check the parameters */
  assert_param(IS_DMA_PERIPH(SCx_DMA));
  assert_param(IS_DMA_FLAG(DMA_FLAG));
  
  if ((SCx_DMA->DMASR & DMA_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Checks whether the specified SCx_DMA pending interrupt is set or not.
  * @param  SCx_IT: where x can be 1 or 2 to select the Serial controller peripheral.
  * @param  DMA_IT: specifies the SCx_DMA interrupt pending to check.
  *   This parameter can be one of the following values:
  *     @arg DMA_IT_TXULODB: DMA transmit buffer B unloaded interrupt pending
  *     @arg DMA_IT_TXULODA: DMA transmit buffer A unloaded interrupt pending
  *     @arg DMA_IT_RXULODB: DMA receive buffer B unloaded interrupt pending
  *     @arg DMA_IT_RXULODA: DMA receive buffer A unloaded interrupt pending
  * @retval The new state of DMA_IT (SET or RESET).
  */
ITStatus SC_DMA_GetITStatus(SC_IT_TypeDef* SCx_IT, uint32_t DMA_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t enablestatus = 0;
  
  /* Check the parameters */
  assert_param(IS_I2C_SPI_DMA_IT_PERIPH(SCx_IT));
  assert_param(IS_DMA_IT(DMA_IT));
  
  enablestatus = (uint32_t)(SCx_IT->IER & DMA_IT);
  if (((SCx_IT->ISR & DMA_IT) != (uint32_t)RESET) && enablestatus)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Clears the SCx_DMA interrupt pending bits.
  * @param  SCx_IT: where x can be 1 to select the Serial controller peripheral.
  * @param  DMA_IT: specifies the SCx_DMA interrupt pending to check.
  *   This parameter can be one of the following values:
  *     @arg DMA_IT_TXULODB: DMA transmit buffer B unloaded interrupt pending
  *     @arg DMA_IT_TXULODA: DMA transmit buffer A unloaded interrupt pending
  *     @arg DMA_IT_RXULODB: DMA receive buffer B unloaded interrupt pending
  *     @arg DMA_IT_RXULODA: DMA receive buffer A unloaded interrupt pending
  * @retval None
  */
void SC_DMA_ClearITPendingBit(SC_IT_TypeDef* SCx_IT, uint32_t DMA_IT)
{
  /* Check the parameters */
  assert_param(IS_I2C_SPI_DMA_IT_PERIPH(SCx_IT));
  assert_param(IS_DMA_IT(DMA_IT));
  
  SCx_IT->ISR = DMA_IT;
}

/**
  * @}
  */
  
/**
  * @}
  */

/**
  * @}
  */ 

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
